{
  "jobs": [
    {
      "name": "Capgemini Portugal",
      "logo": "https://upload.wikimedia.org/wikipedia/en/thumb/d/d8/Capgemini_logo.svg/1280px-Capgemini_logo.svg.png",
      "positions": [
        {
          "title": "Full Stack Developer",
          "company": "Capgemini Portugal",
          "type": "Full-time",
          "location": "Lisbon, Portugal",
          "description": "Continuation from the java junior developer position until 04/2024. Where my project changed to a tolling company doing only backend development. Solely responsible for an epic within a larger project, focusing on the development of a Spring Boot Java backend.",
          "keyFeatures": [
            "Designing and implementing communication with other microservices using Kafka",
            "Integrating with external services such as SFTP servers and AWS S3",
            "Collaborating with Business Analysts to ensure clear understanding of project requirements",
            "Assisting the QA team in identifying testing needs",
            "Onboarding new colleagues",
            "Deploying environments to dev and QA",
            "Providing constructive feedback on areas for improvement"
          ],
          "startMonth": "November",
          "startYear": 2023,
          "endMonth": "",
          "endYear": 0
        },
        {
          "title": "Java Software Engineer",
          "company": "Capgemini Portugal",
          "type": "Internship",
          "location": "Lisbon, Portugal",
          "description": "Migration to Open-Source Solutions for Banking Client. Contributed to the migration of a banking client's existing system to more open-source and cost-effective solutions, utilizing Angular and Spring Boot. Successfully documented and recreated the current website design in Angular, and replicated the backend logic in Spring Boot. This involved transforming database procedures into more efficient and scalable solutions.",
          "keyFeatures": [],
          "startMonth": "April",
          "startYear": 2023,
          "endMonth": "November",
          "endYear": 2023
        }
      ]
    }
  ]
}
